OpenDTEF-v1912/tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/system/derivedFields
// -*- C++ -*-

// ************************************************************************* //

// Create additional volume fields (for sampling)
derivedFields
{
    type    derivedFields;
    libs    (fieldFunctionObjects);
    log     true;

    writeControl    none;
    executeControl  timeStep;
    executeInterval 1;

    derived (rhoU pTotal);
}

// ************************************************************************* //
